load the data from excel file

In [1]:
import pandas as pd

In [2]:
#df1 = pd.read_excel('C:\\Users\\Rohith Reddy\\Desktop\\py_practice\\Python_Pandas\\pd_1.xlsx')
df1 = pd.read_excel('pd_1.xlsx')
print(df1)

   a  1
0  b  2
1  c  3
2  d  4
3  e  5
4  f  6

In [3]:
pd.DataFrame(df1)

   a  1
0  b  2
1  c  3
2  d  4
3  e  5
4  f  6

load the data from csv file

In [4]:
df2 = pd.read_csv('pd_2.csv')
print(df2)

   A  1
0  B  2
1  C  3
2  D  4
3  E  5
4  F  6

In [6]:
pd.DataFrame(df2)

   A  1
0  B  2
1  C  3
2  D  4
3  E  5
4  F  6

create dataframe using dictionary

In [7]:
d = {'name of student':['sai','rothith','reddy'],
     'roll no':[101,102,102],
     'marks':[100,99,80]
    }

In [8]:
pd.DataFrame(d)

  name of student  roll no  marks
0             sai      101    100
1         rothith      102     99
2           reddy      102     80

create dataframe using list of tuple

In [9]:
lt = [('sai',101,100),('rohith',102,99),('reddy',103,80)]

pd.DataFrame(lt)

        0    1    2
0     sai  101  100
1  rohith  102   99
2   reddy  103   80